EVENT_CATEGORIES = [
        ('0', 'هنری'),
        ('1', 'علمی'),
        ('2', 'فرهنگی'),
        ('3', 'ورزشی'),
        ('4', 'سیاسی'),
        ('5', 'اجتماعی'),
        ('6', 'مذهبی'),
        ('7', 'تجاری'),
        ('8', 'سایر'),
]

TOUR_TYPES = [
        ('0', 'فرهنگی'),
        ('1', 'ماجراجویی'),
        ('2', 'تفریحی'),
        ('3', 'حیات وحش'),
        ('4', 'آشپزی'),
        ('5', 'معنوی'),
        ('6', 'عکاسی'),
        ('7', 'تاریخی'),
        ('8', 'طبیعت گردی'),
        ('9', 'سفرهای آموزشی'),
        ('10', 'سایر'),
    ]